In [73]:
from selenium import webdriver
import time
from selenium.webdriver.common.by import By

driver = webdriver.Edge()
driver.get("https://en.wikipedia.org/wiki/List_of_largest_technology_companies_by_revenue")
driver.maximize_window()
time.sleep(2)

In [74]:
# Locating the second table using XPath

target_table = driver.find_element(By.XPATH, "//*[@id='mw-content-text']/div[1]/table[2]")
print("Second table located.")

Second table located.

In [75]:
rows = target_table.find_elements(By.TAG_NAME, "tr")[1:]  # skip header

In [76]:
# Looping through Rows to print all columns


for row in rows:
    cells = row.find_elements(By.TAG_NAME, "td")
    row_data = [cell.text.strip() for cell in cells]
    print(row_data)

['Amazon', '$574.8', '1,525,000', 'US', 'Seattle, Washington & Arlington, Virginia, US']
['Apple', '$394.33', '164,000', 'US', 'Cupertino, California, US']
['Alphabet', '$282.84', '190,234', 'US', 'Mountain View, California, US']
['Samsung Electronics', '$234.13', '270,372', 'South Korea', 'Suwon, South Korea']
['Foxconn', '$222.54', '767,062', 'Taiwan', 'New Taipei City, Taiwan']
['Microsoft', '$198.27', '221,000', 'US', 'Redmond, Washington, US']
['Jingdong', '$152.8', '310,000', 'China', 'Beijing, China']
['Alibaba', '$130.35', '204,891', 'China\nCayman Islands', 'Hangzhou, China & George Town, Cayman Islands']
['AT&T', '$122.4', '149,900', 'US', 'Dallas, Texas, US']
['Meta', '$116.61', '86,482', 'US', 'Menlo Park, California, US']
['Deutsche Telekom', '$112.0', '205,000', 'Germany', 'Bonn, Germany']
['Dell Technologies', '$102.30', '133,000', 'US', 'Round Rock, Texas, US']
['Huawei', '$95.49', '207,000', 'China', 'Shenzhen, China']
['Sony', '$85.25', '112,994', 'Japan', 'Tokyo, Japan']
['Tencent', '$82.44', '108,436', 'China', 'Shenzhen, China']
['Hitachi', '$80.39', '322,525', 'Japan', 'Tokyo, Japan']
['TSMC', '$76.02', '73,090', 'Taiwan', 'New Taipei City, Taiwan']
['LG Electronics', '$64.95', '74,000', 'South Korea', 'Seoul, South Korea']
['Intel', '$63.05', '131,900', 'US', 'Santa Clara, California, US']
['HP Inc.', '$62.98', '53,000', 'US', 'Palo Alto, California, US']
['Lenovo', '$61.95', '71,500', 'Hong Kong/ US', 'Hong Kong China/Morrisville, North Carolina, US[4]']
['Panasonic', '$61.90', '233,391', 'Japan', 'Osaka, Japan']
['Accenture', '$61.59', '721,000', 'Ireland/ US', 'Dublin, Ireland/New York, US']
['Nvidia', '$60.93', '29,600', 'US', 'Santa Clara, California, US']
['IBM', '$60.53', '303,100', 'US', 'Armonk, New York, US']

In [79]:
import pandas as pd

# Collect all rows into a list
data = []
for row in rows:
    cells = row.find_elements(By.TAG_NAME, "td")
    row_data = [cell.text.strip() for cell in cells]
    if row_data:  # skip empty rows
        data.append(row_data)

# Create DataFrame
columns = ["Company", "Revenue (USD billions)", "Profit (USD billions)", "Employees", "Headquarters"]
df = pd.DataFrame(data, columns=columns)

# Preview
df.head()

,Company,Revenue (USD billions),Profit (USD billions),Employees,Headquarters
0,Amazon,$574.8,"1,525,000",US,"Seattle, Washington & Arlington, Virginia, US"
1,Apple,$394.33,"164,000",US,"Cupertino, California, US"
2,Alphabet,$282.84,"190,234",US,"Mountain View, California, US"
3,Samsung Electronics,$234.13,"270,372",South Korea,"Suwon, South Korea"
4,Foxconn,$222.54,"767,062",Taiwan,"New Taipei City, Taiwan"

In [ ]:
# Saving df as CSV
df.to_csv("tech_companies_by_revenue.csv", index=False)
print("CSV file saved successfully.")